docs/CS/MachineLearning/MachineLearning.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-05-18 Thu 22:25 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="weiwu" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline11">1. Week 1</a>
<ul>
<li><a href="#orgheadline1">1.1. What is machine learning</a></li>
<li><a href="#orgheadline2">1.2. Well defined machine learning problem</a></li>
<li><a href="#orgheadline5">1.3. Decision tree learning</a>
<ul>
<li><a href="#orgheadline3">1.3.1. Top-Down induction of DTree</a></li>
<li><a href="#orgheadline4">1.3.2. Entropy</a></li>
</ul>
</li>
<li><a href="#orgheadline6">1.4. Course logistics</a></li>
<li><a href="#orgheadline7">1.5. Model Representation</a></li>
<li><a href="#orgheadline8">1.6. Cost Function</a></li>
<li><a href="#orgheadline9">1.7. Linear Regression with One Variable</a></li>
<li><a href="#orgheadline10">1.8. Linear Algebra Review</a></li>
</ul>
</li>
<li><a href="#orgheadline12">2. Week 2 Linear Regression with Multiple Variables</a></li>
<li><a href="#orgheadline15">3. Week 3</a>
<ul>
<li><a href="#orgheadline13">3.1. Logistic Regression</a></li>
<li><a href="#orgheadline14">3.2. Regularization</a></li>
</ul>
</li>
<li><a href="#orgheadline17">4. Week 4</a>
<ul>
<li><a href="#orgheadline16">4.1. Neural Networks: Representation</a></li>
</ul>
</li>
<li><a href="#orgheadline19">5. Week 5</a>
<ul>
<li><a href="#orgheadline18">5.1. Neural Networks: Learning</a></li>
</ul>
</li>
<li><a href="#orgheadline22">6. Week 6</a>
<ul>
<li><a href="#orgheadline20">6.1. Advice for Applying Machine Learning</a></li>
<li><a href="#orgheadline21">6.2. Machine Learning System Design</a></li>
</ul>
</li>
<li><a href="#orgheadline24">7. Week 7</a>
<ul>
<li><a href="#orgheadline23">7.1. Support Vector Machines</a></li>
</ul>
</li>
<li><a href="#orgheadline27">8. Week 8</a>
<ul>
<li><a href="#orgheadline25">8.1. Unsupervised Learning</a></li>
<li><a href="#orgheadline26">8.2. Dimensionality Reduction</a></li>
</ul>
</li>
<li><a href="#orgheadline30">9. Week 9</a>
<ul>
<li><a href="#orgheadline28">9.1. Anomaly Detection</a></li>
<li><a href="#orgheadline29">9.2. Recommender Systems</a></li>
</ul>
</li>
<li><a href="#orgheadline32">10. Week 10</a>
<ul>
<li><a href="#orgheadline31">10.1. Large Scale Machine Learning</a></li>
</ul>
</li>
<li><a href="#orgheadline34">11. Week 11</a>
<ul>
<li><a href="#orgheadline33">11.1. Application Example: Photo OCR</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline11" class="outline-2">
<h2 id="orgheadline11"><span class="section-number-2">1</span> Week 1</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> What is machine learning</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Study of algorithms that
</p>
<ul class="org-ul">
<li>improve their performance P</li>
<li>at some task T</li>
<li>with experience E</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> Well defined machine learning problem</h3>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">1.3</span> Decision tree learning</h3>
<div class="outline-text-3" id="text-1-3">
<p>
\[H = {H|h: X \to Y}\]
</p>
</div>

<div id="outline-container-orgheadline3" class="outline-4">
<h4 id="orgheadline3"><span class="section-number-4">1.3.1</span> Top-Down induction of DTree</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li>A &rarr; the best decision attribute for next node.</li>
<li>Assign A as decision attribute for node.</li>
<li>For each value of A, create new descendant of node.</li>
<li>Sort training examples to leaf nodes.</li>
<li>If training examples perfectly classified, then STOP, Else iterate over new leaf nodes.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4"><span class="section-number-4">1.3.2</span> Entropy</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Entropy H(X) of a random variable X:
\[H(X) = -\Sum{P(X=i)log_2*P(X=i)}\]
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">1.4</span> Course logistics</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Linear Regression</li>
<li>Logistic Regression</li>
<li>Neural Networks</li>
<li>Support Vector Machines</li>
<li>K-means Clustering</li>
<li>Principal Components</li>
<li>Analysis</li>
<li>Anomaly Detection</li>
<li>Collaborative Filtering</li>
<li>Object Recognition</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">1.5</span> Model Representation</h3>
<div class="outline-text-3" id="text-1-5">
<p>
To establish notation for future use, we’ll use x(i) to denote the “input” variables (living area in this example),
also called input features, and y(i) to denote the “output” or target variable that we are trying to predict (price).
(x(i),y(i)) is called a training example.
m—is called a training set.
</p>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">1.6</span> Cost Function</h3>
</div>

<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">1.7</span> Linear Regression with One Variable</h3>
</div>

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">1.8</span> Linear Algebra Review</h3>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12"><span class="section-number-2">2</span> Week 2 Linear Regression with Multiple Variables</h2>
</div>

<div id="outline-container-orgheadline15" class="outline-2">
<h2 id="orgheadline15"><span class="section-number-2">3</span> Week 3</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">3.1</span> Logistic Regression</h3>
</div>
<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">3.2</span> Regularization</h3>
</div>
</div>
<div id="outline-container-orgheadline17" class="outline-2">
<h2 id="orgheadline17"><span class="section-number-2">4</span> Week 4</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">4.1</span> Neural Networks: Representation</h3>
</div>
</div>
<div id="outline-container-orgheadline19" class="outline-2">
<h2 id="orgheadline19"><span class="section-number-2">5</span> Week 5</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="section-number-3">5.1</span> Neural Networks: Learning</h3>
</div>
</div>
<div id="outline-container-orgheadline22" class="outline-2">
<h2 id="orgheadline22"><span class="section-number-2">6</span> Week 6</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20"><span class="section-number-3">6.1</span> Advice for Applying Machine Learning</h3>
</div>
<div id="outline-container-orgheadline21" class="outline-3">
<h3 id="orgheadline21"><span class="section-number-3">6.2</span> Machine Learning System Design</h3>
</div>
</div>
<div id="outline-container-orgheadline24" class="outline-2">
<h2 id="orgheadline24"><span class="section-number-2">7</span> Week 7</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-orgheadline23" class="outline-3">
<h3 id="orgheadline23"><span class="section-number-3">7.1</span> Support Vector Machines</h3>
</div>
</div>
<div id="outline-container-orgheadline27" class="outline-2">
<h2 id="orgheadline27"><span class="section-number-2">8</span> Week 8</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-orgheadline25" class="outline-3">
<h3 id="orgheadline25"><span class="section-number-3">8.1</span> Unsupervised Learning</h3>
</div>
<div id="outline-container-orgheadline26" class="outline-3">
<h3 id="orgheadline26"><span class="section-number-3">8.2</span> Dimensionality Reduction</h3>
</div>
</div>
<div id="outline-container-orgheadline30" class="outline-2">
<h2 id="orgheadline30"><span class="section-number-2">9</span> Week 9</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-orgheadline28" class="outline-3">
<h3 id="orgheadline28"><span class="section-number-3">9.1</span> Anomaly Detection</h3>
</div>
<div id="outline-container-orgheadline29" class="outline-3">
<h3 id="orgheadline29"><span class="section-number-3">9.2</span> Recommender Systems</h3>
</div>
</div>
<div id="outline-container-orgheadline32" class="outline-2">
<h2 id="orgheadline32"><span class="section-number-2">10</span> Week 10</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-orgheadline31" class="outline-3">
<h3 id="orgheadline31"><span class="section-number-3">10.1</span> Large Scale Machine Learning</h3>
</div>
</div>
<div id="outline-container-orgheadline34" class="outline-2">
<h2 id="orgheadline34"><span class="section-number-2">11</span> Week 11</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-orgheadline33" class="outline-3">
<h3 id="orgheadline33"><span class="section-number-3">11.1</span> Application Example: Photo OCR</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-05-16 Tue&gt;</span></span></p>
<p class="author">Author: weiwu</p>
<p class="date">Created: 2017-05-18 Thu 22:25</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
